<a href="https://colab.research.google.com/github/PolisenoRiccardo/python/blob/main/Esercizi_Pandas_3_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount('/content/drive')
import pandas as pd
titanic = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/POLISENO RICCARDO - titanic.csv', sep= ';')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

Prendere in considerazione il file allegato riguardante i passeggeri del Titanic e scrivere le istruzioni per visualizzare le seguenti informazioni:

In [3]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Montvila; Rev. Juozas,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,Graham; Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston; Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,Behr; Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,Dooley; Mr. Patrick,male,32.0,0,0,370376,7.7500,NaN,Q

1. il numero di passeggeri

In [4]:
len(titanic)

891

2. il numero di passeggeri sopravvissuti

In [5]:
len(titanic[titanic.Survived == 1])

342

3. il numero di passeggeri maschi sopravvissuti

In [6]:
len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'male')])

109

4. la percentuale di passeggeri maschi sopravvissuti

In [7]:
len(titanic[titanic['Sex'] == 'male'])

577

In [8]:
print(len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]) / len(titanic[titanic['Sex'] == 'male']) * 100, '%')

18.890814558058924 %

5. in numeri assoluti, sono sopravvissuti più maschi o più femmine?

In [9]:
if len(titanic[(titanic['Sex'] == 'male') & titanic['Survived'] == 1]) > len(titanic[(titanic['Sex'] == 'female') & titanic['Survived'] == 1]):
  print('Più maschi.')
else:
  print('Più femmine.')

Più femmine.

6. in percentuale, sono sopravvissuti più maschi o più femmine?

In [10]:
if len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]) / len(titanic[titanic['Sex'] == 'male']) > len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'female')]) / len(titanic[titanic['Sex'] == 'female']):
  print('Più maschi in percentuale.')
elif len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]) / len(titanic[titanic['Sex'] == 'male']) < len(titanic[(titanic['Survived'] == 1) & (titanic['Sex'] == 'female')]) / len(titanic[titanic['Sex'] == 'female']):
  print('Più femmine in percentuale.')

Più femmine in percentuale.

7. i passeggeri che si chiamavano William

In [13]:
titanic[titanic.Name.str.contains('William')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
12,13,0,3,Saundercock; Mr. William Henry,male,20.0,0,0,A/5. 2151,8.0500,NaN,S
17,18,1,2,Williams; Mr. Charles Eugene,male,NaN,0,0,244373,13.0000,NaN,S
23,24,1,1,Sloper; Mr. William Thompson,male,28.0,0,0,113788,35.5000,A6,S
31,32,1,1,Spencer; Mrs. William Augustus (Marie Eugenie),female,NaN,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
802,803,1,1,Carter; Master. William Thornton II,male,11.0,1,2,113760,120.0000,B96 B98,S
810,811,0,3,Alexander; Mr. William,male,26.0,0,0,3474,7.8875,NaN,S
864,865,0,2,Gill; Mr. John William,male,24.0,0,0,233866,13.0000,NaN,S
880,881,1,2,Shelley; Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,Rice; Mrs. William (Margaret Norton),female,39.0,0,5,382652,29.1250,NaN,Q

8. i passeggeri che NON si chiamavano William

In [39]:
titanic[~titanic.Name.str.contains('William')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,Moran; Mr. James,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Montvila; Rev. Juozas,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,Graham; Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston; Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,Behr; Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,Dooley; Mr. Patrick,male,32.0,0,0,370376,7.7500,NaN,Q

9. il numero di passeggeri con un'età compresa tra 20 e 30 anni

In [21]:
len(titanic[(titanic['Age'] > 20) & (titanic['Age'] < 30)])

205

10. l'età media dei sopravvissuti

In [22]:
titanic[titanic.Survived == 1]['Age'].mean()

28.343689655172415

11. la differenza tra la tariffa media pagata dai passeggeri di prima classe e quella dei passeggeri di terza classe

In [27]:
titanic[titanic['Pclass']==1]['Fare'].mean() - titanic[titanic['Pclass']==3]['Fare'].mean()

70.479137398167

12. i nomi dei passeggeri di cui non si sa in che cabina si trovavano

In [33]:
titanic[titanic.Cabin.isnull()]['Name']

0                       Braund; Mr. Owen Harris
2                        Heikkinen; Miss. Laina
4                      Allen; Mr. William Henry
5                              Moran; Mr. James
7                Palsson; Master. Gosta Leonard
                         ...
884                      Sutehall; Mr. Henry Jr
885        Rice; Mrs. William (Margaret Norton)
886                       Montvila; Rev. Juozas
888    Johnston; Miss. Catherine Helen "Carrie"
890                         Dooley; Mr. Patrick
Name: Name, Length: 687, dtype: object